In [1]:
import pandas as pd
titan = pd.read_csv('titan.csv')
titan.head()

   SALESPERSON  Old Scheme (in thousands)  New Scheme (in thousands)
0            1                         57                         62
1            2                        103                        122
2            3                         59                         54
3            4                         75                         82
4            5                         84                         84

In [2]:
titan['Diff'] = titan['New Scheme (in thousands)']-titan['Old Scheme (in thousands)']
titan.head()

   SALESPERSON  Old Scheme (in thousands)  New Scheme (in thousands)  Diff
0            1                         57                         62     5
1            2                        103                        122    19
2            3                         59                         54    -5
3            4                         75                         82     7
4            5                         84                         84     0

# 1. Mean of Old Scheme and New Scheme

In [3]:
# Mean of Old Scheme
titan['Old Scheme (in thousands)'].mean()

68.03333333333333

In [4]:
# Mean of New Scheme
titan['New Scheme (in thousands)'].mean()

72.03333333333333

# 2. Five Percentile test

In [5]:
import scipy.stats as st
##st.ttest_ind(titan['Old Scheme (in thousands)'], titan['New Scheme (in thousands)'], equal_var=True)
st.ttest_rel(titan['Old Scheme (in thousands)'], titan['New Scheme (in thousands)'],axis=0)

Ttest_relResult(statistic=-1.5559143823544377, pvalue=0.13057553961337662)

# 3. Conclusion

In [6]:
# p-value .13 > .05 so Rejecting the Null Hypothesis

# 4a) The probability of a type 1 error

In [7]:
# 4a. Alpha is the probaability of making type I error. If its not given its is assumed as 0.05.

# 4b) What is the p- value of the hypothesis test if we test for a difference of $5000?

In [8]:
st.ttest_1samp(titan["Diff"],5)

Ttest_1sampResult(statistic=-0.3889785955886094, pvalue=0.7001334912613286)

In [9]:
# P-value > .5 so there is no significant increase in new scheme even though it was increased by $5000 compared to old scheme

# 4c) Power of the Test.

In [10]:
import statsmodels.stats.power as sp
mean = titan["Diff"].mean()
std = titan["Diff"].std()

In [11]:
sp.ttest_power(effect_size=mean/std, nobs=30, alpha=.05, alternative='larger')

0.4501248712978272

In [12]:
# Power of Test is .45